questions = [
    {"q": "성장 가능성이 큰 신인은 당연히 실수할 수 있다고 생각한다.", "type": "G"},
    {"q": "장타력을 갖춘 타자는 삼진을 많이 당해도 괜찮다.", "type": "P"},
    {"q": "“이 선수는 이것 하나로 먹고산다”는 말이 긍정적으로 느껴진다.", "type": "O"},
    {"q": "불같은 투지보다 실수 없이 기본을 지키는 플레이가 더 가치 있다고 생각한다.", "type": "S"},
    {"q": "공을 강하게 치지 않더라도 매 타석 출루할 수 있는 타자가 팀에 더 필요한 존재라고 생각한다.", "type": "CONT"},
    {"q": "그 어떤 사례를 찾아봐도 팀보다 위대한 선수는 없다.", "type": "CONS"},
    {"q": "수비 포지션을 자유롭게 오갈 수 있는 유틸리티 플레이어가 좋다.", "type": "A"},
    {"q": "클러치 관련 스탯은 내가 보는 여러 스탯 중 특히 유의미하다.", "type": "I"},

    {"q": "오늘의 실수보다도 이 선수가 경험치가 쌓인 이후 미래를 생각하게 된다.", "type": "G"},
    {"q": "타격이 부정확하더라도 한 방이 있는 타자라면 선발로 기용하는 게 맞다고 본다.", "type": "P"},
    {"q": "희생플레이는 사람들에게 과소평가 받는 경향이 있다.", "type": "CONS"},
    {"q": "팀 분위기는 베테랑이 주도하지 않으면 흔들릴 수밖에 없다.", "type": "S"},
    {"q": "한 이닝 다득점보다 여러 이닝에 걸쳐 꾸준히 점수를 내는 끈질긴 공격이 더 좋다.", "type": "CONT"},
    {"q": "홈런, 도루 등 한 가지 능력이 특출난 선수가 보다 매력 있다.", "type": "O"},
    {"q": "사람들은 평소에 수비와 주루, 팀배팅을 너무 과소평가하는 경향이 있다.", "type": "A"},
    {"q": "클러치 능력은 단순 운이 아닌 재능과 노력의 산물이다.", "type": "I"},

    {"q": "매 경기 뭔가 하나씩 배워가는 선수가 눈에 띄면 기분이 좋다.", "type": "G"},
    {"q": "빠르게 달리는 선수보다 장타를 칠 수 있는 선수가 더 좋다.", "type": "P"},
    {"q": "경험이 쌓인 베테랑이 실책을 줄이고 팀 전체에 안정감을 준다고 생각한다.", "type": "S"},
    {"q": "삼진을 적게 당하고 1루에 살아나가는 타자가 장타 한 방보다 경기 흐름에 더 중요한 영향을 준다.", "type": "CONT"},
    {"q": "아무리 꾸준한 선수더라도 클러치 상황에서 강하지 않다면 에이스라고 볼 수 없다.", "type": "I"},
    {"q": "본인 기록보다 팀 승리를 우선시하는 선수가 좋다.", "type": "CONS"},
    {"q": "아무리 잘 쳐도 수비를 너무 못하면 애매한 선수일 뿐이다.", "type": "A"},
    {"q": "수치적인 기록보다 타석에 들어설 때 느껴지는 존재감이 더 중요하다.", "type": "P"},

    {"q": "지금은 부족하더라도 주전으로 성장할 선수라면 계속 선발로 내보내야 한다.", "type": "G"},
    {"q": "가능성은 불확실하며 지금까지 쌓아온 기록이야말로 가장 객관적인 기준이다.", "type": "S"},
    {"q": "장타 한 방보다 매 타석에서 공을 골라내고 투수를 괴롭히는 타자가 더 가치 있다고 본다.", "type": "CONT"},
    {"q": "내가 감독이라면 수비를 좀 못하더라도 타격만 좋으면 계속 기용할 것이다.", "type": "O"},
    {"q": "비클러치 상황에서 때려낸 홈런보다 같은 개수의 결승 단타가 더 치기 어렵고 가치 있다고 생각한다.", "type": "I"},
    {"q": "묵묵히 자기 역할을 다하는 선수가 스타성 있는 선수보다 더욱 눈에 띈다.", "type": "CONS"},
    {"q": "평소에 타자를 판단할 때 타격뿐 아니라 수비, 주루 등의 수치를 여럿 고려한다.", "type": "A"},
    {"q": "주루 센스와 작전 수행 능력은 홈런보다 경기 흐름에 더 지속적인 영향을 미친다.", "type": "CONT"},

    {"q": "성장 가능성이 큰 신인은 당연히 실수할 수 있다고 생각한다.", "type": "G"},
    {"q": "연속 안타 5개로 3점을 내는 것보다 3점 홈런 한 방이 더 짜릿하다.", "type": "P"},
    {"q": "신인의 실책은 경기 흐름을 망치기 때문에 차라리 무난하게 해내는 선수가 낫다고 생각한다.", "type": "S"},
    {"q": "홈런이 없는 타자라도 출루율이 높으면 중심 타선에 둘 수 있다고 생각한다.", "type": "CONT"},
    {"q": "평소 성적은 아쉬워도 결정적인 순간에 한 방을 터뜨리면 감안할 수 있다.", "type": "I"},
    {"q": "각 팀에서 가장 좋아하는 선수가 그리 유명한 선수가 아니다.", "type": "CONS"},
    {"q": "뚜렷한 강점이 없더라도 약점이 없는 선수가 좋다.", "type": "A"},
    {"q": "주전은 가능하지만 더 이상 성장가능성이 보이지 않는 선수보다, 성적은 아직 부족하지만 가능성이 느껴지는 선수를 응원하고 싶다.", "type": "G"},

    {"q": "투수에게 위압감을 주는 강한 스윙이 잔잔한 안타보다 더 가치 있다.", "type": "P"},
    {"q": "의욕적인 플레이보다 실수가 적은 노련한 플레이가 더 믿음이 간다.", "type": "S"},
    {"q": "안타의 절대적인 개수는 적더라도 똑딱똑딱 안타보다 투수가 두려워하는 스윙을 하는 선수가 좋다.", "type": "P"},
    {"q": "타율 같은 수치보다 경기 중 보여주는 성장 가능성이 더 눈에 들어온다.", "type": "G"},
    {"q": "장타력보다는 어떤 공에도 배트를 갖다 댈 수 있는 컨택 능력이 타자의 본질이라 생각한다.", "type": "CONT"},
    {"q": "극단적인 장점 하나는 극단적인 약점을 커버하고도 남는다.", "type": "O"},
    {"q": "베테랑과 신인이 비슷한 성적을 보이면 신인에게 더 많은 기회를 줘야 한다고 생각한다.", "type": "G"},
    {"q": "당장의 팀 전력에 도움이 되는 선수가 경기에 우선 기용되어야 한다.", "type": "S"},

    {"q": "실책이 있더라도 투지 넘치는 플레이를 보면 응원하고 싶어진다.", "type": "G"},
    {"q": "장타력을 갖춘 타자는 삼진을 많이 당해도 괜찮다.", "type": "P"},
    {"q": "출루율은 낮더라도 장타력을 갖춘 선수는 무조건 필요하다.", "type": "P"},
    {"q": "공을 강하게 치지 않더라도 매 타석 출루할 수 있는 타자가 팀에 더 필요한 존재라고 생각한다.", "type": "CONT"},
]




type_labels = {
    "G": "G: 성장지향",
    "S": "S: 안정지향",
    "P": "P: 파워히터 선호",
    "CONT": "CONT: 컨택히터 선호",
    "A": "A: 올라운더 선호",
    "O": "O: 원툴러 선호",
    "CONS": "CONS: 팀플레이 중시",
    "I": "I: 클러치 중시"
}